Revit 2024 API
ExternalService.Description Property
 The description for the service
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public string Description { get; }
Visual Basic
Public ReadOnly Property Description As String
	Get
Visual C++
public:
property String^ Description {
	String^ get ();
}
See Also
ExternalService Class
Autodesk.Revit.DB.ExternalService Namespace